pic-it/app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
---
          <% if post.comments %>
            <% post.comments.each do |comment| %>