pic-it/app/views/posts/show.html.erb

          <% if @post.comments %>
            <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]