pic-it/app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comment_params)
    @comment.user_id = current_user.id

    if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 5], ["content", "hi"], ["created_at", "2017-11-16 18:33:46.954631"], ["updated_at", "2017-11-16 18:33:46.954631"]]

  def destroy
    @comment = @post.comments.find(params[:id])

    if @comment.user_id == current_user.id
      @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 9], ["id", 17], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 17]]

  def set_post
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]