pic-it/app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    if @post = Post.create(post_params)
---
INSERT INTO "posts" ("caption", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "caption" = $4, "updated_at" = $5 WHERE "posts"."id" = $6  [["image_file_name", "IMG_1841.JPG"], ["image_file_size", 134272], ["image_updated_at", "2017-11-16 00:10:26.200078"], ["caption", "pretty"], ["updated_at", "2017-11-16 00:10:26.432163"], ["id", 1]]

  def destroy
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]