pic-it/app/controllers/searches_controller.rb

SELECT "searches".* FROM "searches"
---
  def index
    @searches = Search.all